benchmark/results/run-20260427-082132/microservices-run1-k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6/test.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 2m0s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 1m30s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 001/200 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 001/200 VUs  0m00.9s/1m30.0s

running (0m01.9s), 001/200 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 001/200 VUs  0m01.9s/1m30.0s

running (0m02.9s), 001/200 VUs, 2 complete and 0 interrupted iterations
default   [   3% ] 001/200 VUs  0m02.9s/1m30.0s

running (0m03.9s), 002/200 VUs, 3 complete and 0 interrupted iterations
default   [   4% ] 002/200 VUs  0m03.9s/1m30.0s

running (0m04.9s), 002/200 VUs, 5 complete and 0 interrupted iterations
default   [   5% ] 002/200 VUs  0m04.9s/1m30.0s

running (0m05.9s), 002/200 VUs, 7 complete and 0 interrupted iterations
default   [   7% ] 002/200 VUs  0m05.9s/1m30.0s

running (0m06.9s), 003/200 VUs, 9 complete and 0 interrupted iterations
default   [   8% ] 003/200 VUs  0m06.9s/1m30.0s

running (0m07.9s), 003/200 VUs, 12 complete and 0 interrupted iterations
default   [   9% ] 003/200 VUs  0m07.9s/1m30.0s

running (0m08.9s), 003/200 VUs, 15 complete and 0 interrupted iterations
default   [  10% ] 003/200 VUs  0m08.9s/1m30.0s

running (0m09.9s), 003/200 VUs, 18 complete and 0 interrupted iterations
default   [  11% ] 003/200 VUs  0m09.9s/1m30.0s

running (0m10.9s), 004/200 VUs, 21 complete and 0 interrupted iterations
default   [  12% ] 004/200 VUs  0m10.9s/1m30.0s

running (0m11.9s), 004/200 VUs, 25 complete and 0 interrupted iterations
default   [  13% ] 004/200 VUs  0m11.9s/1m30.0s

running (0m13.6s), 004/200 VUs, 29 complete and 0 interrupted iterations
default   [  14% ] 004/200 VUs  0m12.9s/1m30.0s

running (0m14.6s), 005/200 VUs, 33 complete and 0 interrupted iterations
default   [  15% ] 005/200 VUs  0m13.9s/1m30.0s

running (0m15.6s), 005/200 VUs, 38 complete and 0 interrupted iterations
default   [  17% ] 005/200 VUs  0m14.9s/1m30.0s

running (0m16.6s), 005/200 VUs, 43 complete and 0 interrupted iterations
default   [  18% ] 005/200 VUs  0m15.9s/1m30.0s

running (0m17.6s), 006/200 VUs, 48 complete and 0 interrupted iterations
default   [  19% ] 006/200 VUs  0m16.9s/1m30.0s

running (0m18.6s), 006/200 VUs, 53 complete and 0 interrupted iterations
default   [  20% ] 006/200 VUs  0m17.9s/1m30.0s

running (0m19.6s), 006/200 VUs, 59 complete and 0 interrupted iterations
default   [  21% ] 006/200 VUs  0m18.9s/1m30.0s

running (0m20.6s), 006/200 VUs, 65 complete and 0 interrupted iterations
default   [  22% ] 006/200 VUs  0m19.9s/1m30.0s

running (0m21.6s), 007/200 VUs, 71 complete and 0 interrupted iterations
default   [  23% ] 007/200 VUs  0m20.9s/1m30.0s

running (0m22.6s), 007/200 VUs, 78 complete and 0 interrupted iterations
default   [  24% ] 007/200 VUs  0m21.9s/1m30.0s

running (0m23.6s), 007/200 VUs, 85 complete and 0 interrupted iterations
default   [  25% ] 007/200 VUs  0m22.9s/1m30.0s

running (0m24.6s), 008/200 VUs, 92 complete and 0 interrupted iterations
default   [  27% ] 008/200 VUs  0m23.9s/1m30.0s

running (0m25.6s), 008/200 VUs, 100 complete and 0 interrupted iterations
default   [  28% ] 008/200 VUs  0m24.9s/1m30.0s

running (0m26.6s), 008/200 VUs, 108 complete and 0 interrupted iterations
default   [  29% ] 008/200 VUs  0m25.9s/1m30.0s

running (0m27.6s), 009/200 VUs, 116 complete and 0 interrupted iterations
default   [  30% ] 009/200 VUs  0m26.9s/1m30.0s

running (0m28.6s), 009/200 VUs, 125 complete and 0 interrupted iterations
default   [  31% ] 009/200 VUs  0m27.9s/1m30.0s

running (0m29.6s), 009/200 VUs, 134 complete and 0 interrupted iterations
default   [  32% ] 009/200 VUs  0m28.9s/1m30.0s

running (0m30.6s), 009/200 VUs, 143 complete and 0 interrupted iterations
default   [  33% ] 009/200 VUs  0m29.9s/1m30.0s

running (0m31.6s), 011/200 VUs, 152 complete and 0 interrupted iterations
default   [  34% ] 011/200 VUs  0m30.9s/1m30.0s

running (0m32.6s), 012/200 VUs, 163 complete and 0 interrupted iterations
default   [  35% ] 012/200 VUs  0m31.9s/1m30.0s

running (0m33.6s), 013/200 VUs, 175 complete and 0 interrupted iterations
default   [  37% ] 013/200 VUs  0m32.9s/1m30.0s

running (0m34.6s), 015/200 VUs, 188 complete and 0 interrupted iterations
default   [  38% ] 015/200 VUs  0m33.9s/1m30.0s

running (0m35.6s), 016/200 VUs, 203 complete and 0 interrupted iterations
default   [  39% ] 016/200 VUs  0m34.9s/1m30.0s

running (0m36.6s), 017/200 VUs, 219 complete and 0 interrupted iterations
default   [  40% ] 017/200 VUs  0m35.9s/1m30.0s

running (0m37.6s), 019/200 VUs, 235 complete and 0 interrupted iterations
default   [  41% ] 019/200 VUs  0m36.9s/1m30.0s

running (0m38.6s), 020/200 VUs, 254 complete and 0 interrupted iterations
default   [  42% ] 020/200 VUs  0m37.9s/1m30.0s

running (0m39.6s), 021/200 VUs, 274 complete and 0 interrupted iterations
default   [  43% ] 021/200 VUs  0m38.9s/1m30.0s

running (0m40.6s), 023/200 VUs, 295 complete and 0 interrupted iterations
default   [  44% ] 023/200 VUs  0m39.9s/1m30.0s

running (0m41.6s), 024/200 VUs, 318 complete and 0 interrupted iterations
default   [  45% ] 024/200 VUs  0m40.9s/1m30.0s

running (0m42.6s), 025/200 VUs, 342 complete and 0 interrupted iterations
default   [  47% ] 025/200 VUs  0m41.9s/1m30.0s

running (0m44.3s), 027/200 VUs, 366 complete and 0 interrupted iterations
default   [  48% ] 027/200 VUs  0m42.9s/1m30.0s

running (0m45.3s), 028/200 VUs, 393 complete and 0 interrupted iterations
default   [  49% ] 028/200 VUs  0m43.9s/1m30.0s

running (0m46.3s), 029/200 VUs, 417 complete and 0 interrupted iterations
default   [  50% ] 029/200 VUs  0m44.9s/1m30.0s

running (0m47.3s), 031/200 VUs, 446 complete and 0 interrupted iterations
default   [  51% ] 031/200 VUs  0m45.9s/1m30.0s

running (0m48.3s), 032/200 VUs, 476 complete and 0 interrupted iterations
default   [  52% ] 032/200 VUs  0m46.9s/1m30.0s

running (0m49.3s), 033/200 VUs, 508 complete and 0 interrupted iterations
default   [  53% ] 033/200 VUs  0m47.9s/1m30.0s

running (0m50.3s), 035/200 VUs, 540 complete and 0 interrupted iterations
default   [  54% ] 035/200 VUs  0m48.9s/1m30.0s

running (0m51.3s), 036/200 VUs, 574 complete and 0 interrupted iterations
default   [  55% ] 036/200 VUs  0m49.9s/1m30.0s

running (0m52.3s), 037/200 VUs, 610 complete and 0 interrupted iterations
default   [  57% ] 037/200 VUs  0m50.9s/1m30.0s

running (0m53.3s), 039/200 VUs, 647 complete and 0 interrupted iterations
default   [  58% ] 039/200 VUs  0m51.9s/1m30.0s

running (0m54.3s), 040/200 VUs, 686 complete and 0 interrupted iterations
default   [  59% ] 040/200 VUs  0m52.9s/1m30.0s

running (0m55.3s), 041/200 VUs, 724 complete and 0 interrupted iterations
default   [  60% ] 041/200 VUs  0m53.9s/1m30.0s

running (0m56.3s), 043/200 VUs, 765 complete and 0 interrupted iterations
default   [  61% ] 043/200 VUs  0m54.9s/1m30.0s

running (0m57.3s), 044/200 VUs, 808 complete and 0 interrupted iterations
default   [  62% ] 044/200 VUs  0m55.9s/1m30.0s

running (0m58.3s), 045/200 VUs, 851 complete and 0 interrupted iterations
default   [  63% ] 045/200 VUs  0m56.9s/1m30.0s

running (0m59.3s), 047/200 VUs, 896 complete and 0 interrupted iterations
default   [  64% ] 047/200 VUs  0m57.9s/1m30.0s

running (1m00.3s), 048/200 VUs, 943 complete and 0 interrupted iterations
default   [  65% ] 048/200 VUs  0m58.9s/1m30.0s

running (1m01.3s), 049/200 VUs, 984 complete and 0 interrupted iterations
default   [  67% ] 049/200 VUs  0m59.9s/1m30.0s

running (1m02.3s), 054/200 VUs, 1033 complete and 0 interrupted iterations
default   [  68% ] 054/200 VUs  1m00.9s/1m30.0s

running (1m03.3s), 059/200 VUs, 1087 complete and 0 interrupted iterations
default   [  69% ] 059/200 VUs  1m01.9s/1m30.0s

running (1m04.3s), 064/200 VUs, 1146 complete and 0 interrupted iterations
default   [  70% ] 064/200 VUs  1m02.9s/1m30.0s

running (1m05.3s), 069/200 VUs, 1210 complete and 0 interrupted iterations
default   [  71% ] 069/200 VUs  1m03.9s/1m30.0s

running (1m06.3s), 074/200 VUs, 1279 complete and 0 interrupted iterations
default   [  72% ] 074/200 VUs  1m04.9s/1m30.0s

running (1m07.3s), 079/200 VUs, 1352 complete and 0 interrupted iterations
default   [  73% ] 079/200 VUs  1m05.9s/1m30.0s

running (1m08.3s), 084/200 VUs, 1431 complete and 0 interrupted iterations
default   [  74% ] 084/200 VUs  1m06.9s/1m30.0s

running (1m09.3s), 089/200 VUs, 1515 complete and 0 interrupted iterations
default   [  75% ] 089/200 VUs  1m07.9s/1m30.0s

running (1m10.3s), 094/200 VUs, 1597 complete and 0 interrupted iterations
default   [  77% ] 094/200 VUs  1m08.9s/1m30.0s

running (1m11.3s), 099/200 VUs, 1689 complete and 0 interrupted iterations
default   [  78% ] 099/200 VUs  1m09.9s/1m30.0s

running (1m12.3s), 104/200 VUs, 1782 complete and 0 interrupted iterations
default   [  79% ] 104/200 VUs  1m10.9s/1m30.0s

running (1m13.3s), 109/200 VUs, 1886 complete and 0 interrupted iterations
default   [  80% ] 109/200 VUs  1m11.9s/1m30.0s

running (1m15.1s), 114/200 VUs, 1995 complete and 0 interrupted iterations
default   [  81% ] 114/200 VUs  1m12.9s/1m30.0s

running (1m16.1s), 119/200 VUs, 2109 complete and 0 interrupted iterations
default   [  82% ] 119/200 VUs  1m13.9s/1m30.0s

running (1m17.1s), 124/200 VUs, 2227 complete and 0 interrupted iterations
default   [  83% ] 124/200 VUs  1m14.9s/1m30.0s

running (1m18.1s), 129/200 VUs, 2351 complete and 0 interrupted iterations
default   [  84% ] 129/200 VUs  1m15.9s/1m30.0s

running (1m19.1s), 134/200 VUs, 2480 complete and 0 interrupted iterations
default   [  85% ] 134/200 VUs  1m16.9s/1m30.0s

running (1m20.1s), 139/200 VUs, 2608 complete and 0 interrupted iterations
default   [  87% ] 139/200 VUs  1m17.9s/1m30.0s

running (1m21.1s), 144/200 VUs, 2743 complete and 0 interrupted iterations
default   [  88% ] 144/200 VUs  1m18.9s/1m30.0s

running (1m22.1s), 149/200 VUs, 2887 complete and 0 interrupted iterations
default   [  89% ] 149/200 VUs  1m19.9s/1m30.0s

running (1m23.1s), 154/200 VUs, 3032 complete and 0 interrupted iterations
default   [  90% ] 154/200 VUs  1m20.9s/1m30.0s

running (1m24.1s), 159/200 VUs, 3184 complete and 0 interrupted iterations
default   [  91% ] 159/200 VUs  1m21.9s/1m30.0s

running (1m25.1s), 164/200 VUs, 3343 complete and 0 interrupted iterations
default   [  92% ] 164/200 VUs  1m22.9s/1m30.0s

running (1m26.1s), 169/200 VUs, 3507 complete and 0 interrupted iterations
default   [  93% ] 169/200 VUs  1m23.9s/1m30.0s

running (1m27.1s), 174/200 VUs, 3676 complete and 0 interrupted iterations
default   [  94% ] 174/200 VUs  1m24.9s/1m30.0s

running (1m28.1s), 179/200 VUs, 3806 complete and 0 interrupted iterations
default   [  95% ] 179/200 VUs  1m25.9s/1m30.0s

running (1m29.1s), 184/200 VUs, 3985 complete and 0 interrupted iterations
default   [  97% ] 184/200 VUs  1m26.9s/1m30.0s

running (1m30.1s), 189/200 VUs, 4169 complete and 0 interrupted iterations
default   [  98% ] 189/200 VUs  1m27.9s/1m30.0s

running (1m31.1s), 194/200 VUs, 4343 complete and 0 interrupted iterations
default   [  99% ] 194/200 VUs  1m28.9s/1m30.0s

running (1m32.1s), 199/200 VUs, 4534 complete and 0 interrupted iterations
default   [ 100% ] 199/200 VUs  1m29.9s/1m30.0s

running (1m33.1s), 035/200 VUs, 4716 complete and 0 interrupted iterations
default ↓ [ 100% ] 199/200 VUs  1m30s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration....: avg=5.47ms med=3.32ms min=900.46µs max=465.96ms p(90)=11.7ms p(95)=16.76ms p(99)=26.14ms
    http_req_failed......: 100.00% 19004 out of 19004
    http_reqs............: 19004   204.073722/s

    EXECUTION
    iteration_duration...: avg=1.02s  med=1.01s  min=1s       max=1.12s    p(90)=1.05s  p(95)=1.06s   p(99)=1.09s  
    iterations...........: 4751    51.018431/s
    vus..................: 35      min=1              max=199
    vus_max..............: 200     min=200            max=200

    NETWORK
    data_received........: 6.0 MB  64 kB/s
    data_sent............: 3.4 MB  36 kB/s



running (1m33.1s), 000/200 VUs, 4751 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  1m30s